/***************************************************************************/
/* Ring0.C - Выполнение кода в нулевом кольце (Ring 0)                     */
/* Версия 1.01 (Май 2002 г.)                                               */
/*                                                                         */
/* OS: Windows 9x                                                          */
/*                                                                         */
/* Copyright (c) 2002 rivitna                                              */
/***************************************************************************/
/*-------------------------------------------------------------------------*/
#ifndef __RING0_H__
#define __RING0_H__
/*-------------------------------------------------------------------------*/
#ifdef __cplusplus
extern "C" {
#endif  /* __cplusplus */
/*-------------------------------------------------------------------------*/
/* Тип процедуры, вызываемой в нулевом кольце Ring 0 */
typedef DWORD (__fastcall *PRING0FUNC)(
  DWORD dwParam
  );

/* Вызов процедуры в нулевом кольце Ring 0 (Windows 9x) */
BOOL __stdcall CallRing0(
  PRING0FUNC pRing0Func,
  DWORD dwParam,
  LPDWORD lpdwRetValue
  );
/*-------------------------------------------------------------------------*/
#ifdef __cplusplus
}  /* extern "C" */
#endif /* __cplusplus */
/*-------------------------------------------------------------------------*/
#endif  /* __RING0_H__ */
